app/Controllers/Auth.php

SELECT *
FROM `admin`
WHERE `user` = 'imredhat'
 LIMIT 1
---
    public function verify()
    {

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');


        $user = new AdminModel();
        $user = $user->where('user', $username)->first();