app/Controllers/Option.php

    public function index()
    {

        $model = new FareModel();
        $data['options'] = $model->findAll();
---
SELECT *
FROM `option`