app/Controllers/Service.php

SELECT *
FROM `user`
WHERE `user`.`deleted_at` IS NULL
SELECT *
FROM `driver`
SELECT *
FROM `option`
---
    public function AddService()
    {

        $data['Packages']    = (new PackagesModel())->findAll();
        $data['Users']      = (new UserModel())->findAll();
        $data['Drivers']    = (new DriverModel())->withDeleted()->findAll();
        $data['options']    = (new FareModel())->findAll();