app/Models/CarModel.php

    public function GetDriverCars($id)
    {
        return $this->select('cars.cid,cars.driver_id ,cars.brand,cars.pelak,cars.iran,cars.harf,cars.pelak_last,brand.brand as car_brand , cars.type,cars.*')
            ->join('brand', 'brand.TiD = cars.brand')
            ->where('driver_id', $id)
            ->findAll();
---
SELECT `cars`.`cid`, `cars`.`driver_id`, `cars`.`brand`, `cars`.`pelak`, `cars`.`iran`, `cars`.`harf`, `cars`.`pelak_last`, `brand`.`brand` as `car_brand`
FROM `cars`
JOIN `brand` ON `brand`.`TiD` = `cars`.`brand`
WHERE `driver_id` = '10'