app/Models/ServiceModel.php

    public function getAllService()
    {
        return $this->select('service.*, user.name as passenger_name, user.lname as passenger_last,          driver.name as driver_name,driver.lname as driver_last,driver.ax as driver_photo' )
        ->join('user', 'user.id = service.passenger_id')
        ->join('driver', 'driver.did = service.driver_id')
        ->findAll();
---
SELECT `service`.*, `user`.`name` as `passenger_name`, `user`.`lname` as `passenger_last`, `driver`.`name` as `driver_name`, `driver`.`lname` as `driver_last`, `driver`.`ax` as `driver_photo`
FROM `service`
JOIN `user` ON `user`.`id` = `service`.`passenger_id`
JOIN `driver` ON `driver`.`did` = `service`.`driver_id`